// Написать программу,которая из  имеющегося массива строк формирует
//  массив из строк,длина которых меньше либо равна 3 символам

Console.WriteLine("2");
